'''
Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько в ней слов. Используйте для решения
задачи функцию `count`

'''

word = 'The capital of England is London'
print('The capital of England is London'.count(' ') + 1)


#     Или
# word = input('введите слова')
# print(word.count(' ') + 1)
